# CLI tools
brew "awscli"
brew "bitwarden-cli"
brew "cocoapods"
brew "corepack"
brew "openjdk"
brew "direnv"
brew "gh"
brew "git"
brew "nvm"
brew "python"
brew "ruby"
brew "watchman"
brew "xcodes"

# Fonts
cask "font-hack-nerd-font"

# GUI apps: terminal and editors
cask "warp"
cask "visual-studio-code"

# GUI apps: AI assistants
cask "chatgpt"
cask "chatgpt-atlas"
cask "claude"
cask "codex"

# GUI apps: communication and collaboration
cask "notion"

# GUI apps: browser and API/network tooling
cask "google-chrome"
cask "postman"

# GUI apps: productivity and system
cask "istat-menus"
cask "qlmarkdown"
cask "raycast"
cask "react-native-debugger"
cask "rectangle"

# GUI apps: security
cask "bitwarden"

# Android SDK (CLI tools only, no Android Studio)
cask "android-commandlinetools"
