tap "homebrew/bundle"

# CLI tools
brew "awscli"
brew "cocoapods"
brew "direnv"
brew "gh"
brew "git"
brew "glab"
brew "nvm"
brew "python"
brew "ruby"
brew "watchman"
brew "xcodes"

# GUI apps: terminal and editors
cask "warp"
cask "visual-studio-code"

# GUI apps: AI assistants
cask "chatgpt"
cask "claude"
cask "codex"

# GUI apps: communication and collaboration
cask "discord"
cask "microsoft-teams"
cask "notion"
cask "slack"

# GUI apps: browser and API/network tooling
cask "google-chrome"
cask "postman"
cask "proxyman"

# GUI apps: productivity and system
cask "istat-menus"
cask "qlmarkdown"
cask "raycast"
cask "react-native-debugger"
cask "rectangle"

# GUI apps: security and containers
cask "1password"
cask "orbstack"
