# Linting & formatting
dbaeumer.vscode-eslint
esbenp.prettier-vscode

# Git
eamodio.gitlens

# Markdown
yzhang.markdown-all-in-one

# Theme & icons
sdras.night-owl
vscode-icons-team.vscode-icons

# Productivity
usernamehw.errorlens
mikestead.dotenv
formulahendry.auto-rename-tag

# AI
anthropic.claude-code
